AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// L298N 使能脚（l298n 模块：EN 输出高有效——页面「5V 使能高电平有效，常态
// 下跳线帽接 VCC」；本件 l298n_init 置高（配合取跳线帽 + GPIO 使能），初始
// SET = 使能。默认 PA27——与 HUIDU R2（8 路灰度巡线）、ADC12_0 adcPin0
// （ir_distance MEM3）、TTP224 OUT4（触摸按键）重叠：使能脚与巡线（巡线车
// 惯用轻量 TB6612，与大电流驱动不同框）/模拟测距/触摸面板不同框、同选概率
// 最低，同选时经引脚绑定消解）
const L298N = GPIO.addInstance();
L298N.$name = "L298N";
L298N.associatedPins.create(1);
L298N.associatedPins[0].$name            = "EN";
L298N.associatedPins[0].direction        = "OUTPUT";
L298N.associatedPins[0].initialValue     = "SET";
L298N.associatedPins[0].pin.$assign      = "PA27";

// 电机 PID 调度定时器（10ms 周期中断，pid 模块用；编译闭环只需宏存在）
MOTOR_PID.$name              = "MOTOR_PID";
MOTOR_PID.profile            = "Basic_Periodic";
MOTOR_PID.peripheral.$assign = "TIMG6";

// 计程定时器（ntb_time 模块读计数）
NTB.$name              = "NTB";
NTB.profile            = "Basic_Periodic";
NTB.peripheral.$assign = "TIMG7";

// 超声波 TRIG/ECHO（sr04 模块：TRIG 输出触发 / ECHO 输入回波；测宽用
// CPU 忙等计数，不占 TIMER 外设——地猛星 SysConfig TIMER 实例仅暴露
// TIMG0/6/7/8/12（已被 motor/pid/ntb_time/servo/step_motor 全占，没有
// 新定时器可加）。默认 TRIG=PB24（与 STEP_MOTOR RST2 重叠）、ECHO=PB8
// （与 STEP_MOTOR DCY2 重叠）——测距与步进同选概率最低，同选时经引脚
// 绑定消解）
SR04.$name = "SR04";
SR04.associatedPins.create(2);
SR04.associatedPins[0].$name        = "TRIG";
SR04.associatedPins[0].direction    = "OUTPUT";
SR04.associatedPins[0].initialValue = "CLEARED";
SR04.associatedPins[0].pin.$assign  = "PB24";
SR04.associatedPins[1].$name        = "ECHO";
SR04.associatedPins[1].direction    = "INPUT";
SR04.associatedPins[1].pin.$assign  = "PB8";

// 电机方向/使能 + 编码器中断（key 模块 GROUP1_IRQHandler 消费 IIDX）
DC_MOTOR.$name = "DC_MOTOR";
DC_MOTOR.associatedPins.create(8);
DC_MOTOR.associatedPins[0].$name        = "AIN1";
DC_MOTOR.associatedPins[0].direction    = "OUTPUT";
DC_MOTOR.associatedPins[0].initialValue = "CLEARED";
DC_MOTOR.associatedPins[0].pin.$assign  = "PB9";
DC_MOTOR.associatedPins[1].$name        = "AIN2";
DC_MOTOR.associatedPins[1].direction    = "OUTPUT";
DC_MOTOR.associatedPins[1].initialValue = "CLEARED";
DC_MOTOR.associatedPins[1].pin.$assign  = "PA18";
DC_MOTOR.associatedPins[2].$name        = "BIN1";
DC_MOTOR.associatedPins[2].direction    = "OUTPUT";
DC_MOTOR.associatedPins[2].initialValue = "CLEARED";
DC_MOTOR.associatedPins[2].pin.$assign  = "PB18";
DC_MOTOR.associatedPins[3].$name        = "BIN2";
DC_MOTOR.associatedPins[3].direction    = "OUTPUT";
DC_MOTOR.associatedPins[3].initialValue = "CLEARED";
DC_MOTOR.associatedPins[3].pin.$assign  = "PA7";
DC_MOTOR.associatedPins[4].$name        = "AA";
DC_MOTOR.associatedPins[4].direction    = "INPUT";
DC_MOTOR.associatedPins[4].interruptEn  = true;
DC_MOTOR.associatedPins[4].polarity     = "RISE_FALL";
DC_MOTOR.associatedPins[4].pin.$assign  = "PA16";
DC_MOTOR.associatedPins[5].$name        = "AB";
DC_MOTOR.associatedPins[5].direction    = "INPUT";
DC_MOTOR.associatedPins[5].interruptEn  = true;
DC_MOTOR.associatedPins[5].polarity     = "RISE_FALL";
DC_MOTOR.associatedPins[5].pin.$assign  = "PA17";
DC_MOTOR.associatedPins[6].$name        = "BA";
DC_MOTOR.associatedPins[6].direction    = "INPUT";
DC_MOTOR.associatedPins[6].interruptEn  = true;
DC_MOTOR.associatedPins[6].polarity     = "RISE_FALL";
DC_MOTOR.associatedPins[6].pin.$assign  = "PB19";
DC_MOTOR.associatedPins[7].$name        = "BB";
DC_MOTOR.associatedPins[7].direction    = "INPUT";
DC_MOTOR.associatedPins[7].interruptEn  = true;
DC_MOTOR.associatedPins[7].polarity     = "RISE_FALL";
DC_MOTOR.associatedPins[7].pin.$assign  = "PB20";

// 8 路灰度循线输入（引脚空闲位，按实际接线改）
HUIDU.$name = "HUIDU";
HUIDU.associatedPins.create(8);
HUIDU.associatedPins[0].$name       = "L1";
HUIDU.associatedPins[0].direction   = "INPUT";
HUIDU.associatedPins[0].pin.$assign = "PA22";
HUIDU.associatedPins[1].$name       = "L2";
HUIDU.associatedPins[1].direction   = "INPUT";
HUIDU.associatedPins[1].pin.$assign = "PA23";
HUIDU.associatedPins[2].$name       = "L3";
HUIDU.associatedPins[2].direction   = "INPUT";
HUIDU.associatedPins[2].pin.$assign = "PA24";
HUIDU.associatedPins[3].$name       = "L4";
HUIDU.associatedPins[3].direction   = "INPUT";
HUIDU.associatedPins[3].pin.$assign = "PA25";
HUIDU.associatedPins[4].$name       = "R1";
HUIDU.associatedPins[4].direction   = "INPUT";
HUIDU.associatedPins[4].pin.$assign = "PA26";
HUIDU.associatedPins[5].$name       = "R2";
HUIDU.associatedPins[5].direction   = "INPUT";
HUIDU.associatedPins[5].pin.$assign = "PA27";
HUIDU.associatedPins[6].$name       = "R3";
HUIDU.associatedPins[6].direction   = "INPUT";
HUIDU.associatedPins[6].pin.$assign = "PB6";
HUIDU.associatedPins[7].$name       = "R4";
HUIDU.associatedPins[7].direction   = "INPUT";
HUIDU.associatedPins[7].pin.$assign = "PB7";

// 启动按键输入（实例名 KEY → KEY_PORT 宏；引脚名 START → KEY_START_PIN）
KEY.$name = "KEY";
KEY.associatedPins.create(1);
KEY.associatedPins[0].$name       = "START";
KEY.associatedPins[0].direction   = "INPUT";
KEY.associatedPins[0].pin.$assign = "PA2";

// 红外对射传感器输入（ir_beam 模块：实例名 IR_BEAM → IR_BEAM_PORT 宏；
// 引脚名 OUT → IR_BEAM_OUT_PIN；默认 PA8——仅与 DIGIT_UART 默认重叠，
// 同选时经引脚绑定消解；内部上拉 = 遮挡（开集输出截止）时由电阻钳到高，
// 无遮挡 = 接收管导通拉低）
IR_BEAM.$name = "IR_BEAM";
IR_BEAM.associatedPins.create(1);
IR_BEAM.associatedPins[0].$name            = "OUT";
IR_BEAM.associatedPins[0].direction        = "INPUT";
IR_BEAM.associatedPins[0].internalResistor = "PULL_UP";
IR_BEAM.associatedPins[0].pin.$assign      = "PA8";

// WS2812 幻彩灯带数据脚（ws2812 模块：单 GPIO 强推挽输出，位操作时序；
// 默认 PA14——与 DCC_100_PWM2（step_motor 脉冲）默认重叠，同选时经引脚
// 绑定消解。地猛星 2×20 排针 31 个 IO 已被母版默认布局全占，新模块默认
// 脚按「与同选概率最低者重叠」分配，IR_BEAM/PA8 先例）
WS2812.$name = "WS2812";
WS2812.associatedPins.create(1);
WS2812.associatedPins[0].$name        = "IN";
WS2812.associatedPins[0].direction    = "OUTPUT";
WS2812.associatedPins[0].initialValue = "CLEARED";
WS2812.associatedPins[0].pin.$assign  = "PA14";

// HX711 称重（hx711 模块：SCK 输出 / DT 输入（片上拉，空闲高 = 未就绪，
// 数据就绪拉低）。默认 SCK=PA28（与 IMU601 TX 重叠）、DT=PA31（与 IMU601
// RX 重叠）——称重与串口陀螺仪同为「姿态/力」低频组合，同选概率最低；
// 同选时经引脚绑定消解）
HX711.$name = "HX711";
HX711.associatedPins.create(2);
HX711.associatedPins[0].$name        = "SCK";
HX711.associatedPins[0].direction    = "OUTPUT";
HX711.associatedPins[0].initialValue = "CLEARED";
HX711.associatedPins[0].pin.$assign  = "PA28";
HX711.associatedPins[1].$name        = "DT";
HX711.associatedPins[1].direction    = "INPUT";
HX711.associatedPins[1].internalResistor = "PULL_UP";
HX711.associatedPins[1].pin.$assign  = "PA31";

// AHT10 温湿度软 I2C（aht10 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设。默认 SCL=PB6（与 STEP_MOTOR SLP2 / HUIDU R3
// 重叠）、SDA=PB7（与 STEP_MOTOR DIR2 / HUIDU R4 重叠）——温湿度与步进/
// 巡线同选概率最低，同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）
AHT10.$name = "AHT10";
AHT10.associatedPins.create(2);
AHT10.associatedPins[0].$name        = "SCL";
AHT10.associatedPins[0].direction    = "OUTPUT";
AHT10.associatedPins[0].initialValue = "CLEARED";
AHT10.associatedPins[0].pin.$assign  = "PB6";
AHT10.associatedPins[1].$name        = "SDA";
AHT10.associatedPins[1].direction    = "OUTPUT";
AHT10.associatedPins[1].initialValue = "CLEARED";
AHT10.associatedPins[1].pin.$assign  = "PB7";

// DHT11 单总线温湿度（dht11 模块：DATA 双向——输出起始信号/释放总线、
// 输入采样响应与 40bit 数据位，方向运行时切换（照 AHT10_SDA 先例）；
// 位时序 CPU 忙等 + delay 模块换算，不占 TIMER。默认 DATA=PB7——与
// AHT10 SDA（温湿度互替、同选概率最低）/STEP_MOTOR DIR2/HUIDU R4
// 重叠（温湿度与步进/巡线同选概率最低，AHT10 先例），同选时经引脚绑定消解）
const DHT11 = GPIO.addInstance();
DHT11.$name = "DHT11";
DHT11.associatedPins.create(1);
DHT11.associatedPins[0].$name        = "DATA";
DHT11.associatedPins[0].direction    = "OUTPUT";
DHT11.associatedPins[0].initialValue = "SET";
DHT11.associatedPins[0].pin.$assign  = "PB7";

// DS18B20 单总线温度（ds18b20 模块：DATA 双向——输出起始/释放总线、输入采样
// 应答与数据位，方向运行时切换（照 DHT11_DATA 先例）；位时序 CPU 忙等 +
// delay 模块换算（复位 750us、位槽 62-64us），不占 TIMER；模块板自带上拉。
// 默认 DATA=PA7——与 DC_MOTOR BIN2（双电机）、SERVO_PWM ccp0（舵机）、
// RC522 CS（读卡门禁）重叠：接触测温与运动控制/读卡不同框、同选概率最低
// （刻意不叠温湿度/光照/显示/语音件——测温+显示/语音/传感站为常见搭配，
// 同 mlx90614 选型口诀；也不叠 I2C_0 的 PA0/PA1——硬件 I2C 脚与 i2c_bus_share
// 测试互扰，批次 5 实测调整先例），同选时经引脚绑定消解）
const DS18B20 = GPIO.addInstance();
DS18B20.$name = "DS18B20";
DS18B20.associatedPins.create(1);
DS18B20.associatedPins[0].$name        = "DATA";
DS18B20.associatedPins[0].direction    = "OUTPUT";
DS18B20.associatedPins[0].initialValue = "SET";
DS18B20.associatedPins[0].pin.$assign  = "PA7";

// BH1750 光照度软 I2C（bh1750 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设，照 AHT10 先例。默认 SCL=PA12 / SDA=PA13——
// 与 PWMAB C0/C1（motor 双路 PWM）重叠：光照度监测/台灯类与双电机驱动
// 同选概率最低（故意不叠 AHT10 的 PB6/PB7——温湿度+光照=环境监测站常见
// 组合），同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）
const BH1750 = GPIO.addInstance();
BH1750.$name = "BH1750";
BH1750.associatedPins.create(2);
BH1750.associatedPins[0].$name        = "SCL";
BH1750.associatedPins[0].direction    = "OUTPUT";
BH1750.associatedPins[0].initialValue = "CLEARED";
BH1750.associatedPins[0].pin.$assign  = "PA12";
BH1750.associatedPins[1].$name        = "SDA";
BH1750.associatedPins[1].direction    = "OUTPUT";
BH1750.associatedPins[1].initialValue = "CLEARED";
BH1750.associatedPins[1].pin.$assign  = "PA13";

