AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// 人体红外感应输入（human_ir 模块：OUT 输入 + 内部上拉——HC-SR501 模块被
// 感应到人体时输出高电平（模块介绍「人进入其感应范围则输出高电平」+ 规格
// 「电平输出：高3.3V/低0V」；页面函数注释「0=感应到」与介绍矛盾——按
// HC-SR501 器件标准高=检测到修正，模块 notes 记录）；电平直读无去抖/无
// GPIO 中断（GROUP1 仍被 motor 编码器独占，页面同为电平直读）。默认 PB8——
// 与 STEP_MOTOR DCY2 / SR04 ECHO / AT24C02 SDA 重叠：人体红外与步进/测距/
// 存储不同框、同选概率最低（感应灯/防盗报警惯配温湿度/光照/显示/语音/无线/
// 按键/蜂鸣——刻意不叠），同选时经引脚绑定消解）
const HUMAN_IR = GPIO.addInstance();
HUMAN_IR.$name = "HUMAN_IR";
HUMAN_IR.associatedPins.create(1);
HUMAN_IR.associatedPins[0].$name            = "OUT";
HUMAN_IR.associatedPins[0].direction        = "INPUT";
HUMAN_IR.associatedPins[0].internalResistor = "PULL_UP";
HUMAN_IR.associatedPins[0].pin.$assign      = "PB8";

// 微波多普勒雷达输入（microwave_radar 模块：OUT 输入 + 内部上拉——HB100
// 模块检测到物体移动时 OUT 低电平（页面函数注释「1=未检测到 0=检测到」+
// main 演示（OUT 输入为 0 判移动）同口径，页面自一致）；电平直读无去抖/无
// GPIO 中断（GROUP1 仍被 motor 编码器独占，页面同为电平直读）；页面演示的
// 开/关门时序逻辑归生成骨架（ADR 0009）。默认 PA31——2026-09-06 SysConfig
// CLI 实证 PA0/PA1 不在 GPIO 输入实例 pin 选项内（"No option named PA0
// defined"；GPIO 输出可配 PA0——ir_remote_tx 先例，输入不可）→ 改选
// PA31：与 IMU601 RX（姿态）/HX711 DT（称重）/FINGERPRINT_UART RX（身份）/
// SHT30 SDA（温湿度）重叠——微波雷达（自动门/车流/倒车）与姿态/称重/身份/
// 温湿度采集不同框、同选概率最低（自动门/车流惯配电机/显示/蜂鸣/无线/超声/
// 人体红外——刻意不叠：PWMAB/MAX7219/LED_BEEP/无线族/SR04 脚/human_ir PB8），
// 同选时经引脚绑定消解；与同批 human_ir（PB8）刻意错开（人体红外+微波组合
// 常同选，默认即不撞）
const MICROWAVE = GPIO.addInstance();
MICROWAVE.$name = "MICROWAVE";
MICROWAVE.associatedPins.create(1);
MICROWAVE.associatedPins[0].$name            = "OUT";
MICROWAVE.associatedPins[0].direction        = "INPUT";
MICROWAVE.associatedPins[0].internalResistor = "PULL_UP";
MICROWAVE.associatedPins[0].pin.$assign      = "PA31";

// GP2Y1014AU 粉尘传感器 LED 驱动输出（gp2y1014au 模块：LED 脉冲驱动——页面
// Read_dust_concentration 时序：clear（LED 亮）→ 280us → 采样 → 40us → set
// （LED 关）→ 9680us，10ms 周期；**器件必需**——GP2Y1014AU 内置红外 LED
// 必须由主控脉冲驱动才能测量，无此脚传感器不工作（薄封装件唯一例外：ADC 仍
// 薄封装共读 MEM0（见 ADC 段），LED 为 GPIO 输出实例）。页面极性原样：
// clear = LED 亮、set = LED 关（空闲高 = 关闭）。默认 PA1——与 I2C_0 sclPin
// （ml_mpu6050 硬 I2C SCL）重叠：粉尘浓度监测与姿态采集不同框、同选概率
// 最低故叠此脚（PA0/PA1 不可作 GPIO 输入——2026-09-06 SysConfig CLI 实证；
// GPIO 输出可配 PA0——ir_remote_tx 先例，PA1 同型经编译矩阵 CLI 实证），
// 同选时经引脚绑定消解；刻意不叠传感站标配（温湿度/光照/气体/显示）、
// 报警（PA15 蜂鸣）、无线/触摸/运动/语音件——粉尘监测站 = 显示 + 报警 +
// 温湿度 + 无线遥测常见组合，默认即不撞）
const GP2Y1014 = GPIO.addInstance();
GP2Y1014.$name = "GP2Y1014";
GP2Y1014.associatedPins.create(1);
GP2Y1014.associatedPins[0].$name            = "LED";
GP2Y1014.associatedPins[0].direction        = "OUTPUT";
GP2Y1014.associatedPins[0].initialValue     = "SET";
GP2Y1014.associatedPins[0].pin.$assign      = "PA1";

// 双轴摇杆按键（joystick 模块：SW 输入上拉低有效；实例名 JOYSTICK →
// JOYSTICK_PORT 宏；引脚名 SW → JOYSTICK_SW_PIN；默认 PA9——仅与
// DIGIT_UART RX 默认重叠（K230 视觉串口），同选时经引脚绑定消解。
// X/Y 两轴走 ADC12_0 MEM1/MEM2（见 ADC 段），SW 独立 GPIO）
JOYSTICK.$name = "JOYSTICK";
JOYSTICK.associatedPins.create(1);
JOYSTICK.associatedPins[0].$name            = "SW";
JOYSTICK.associatedPins[0].direction        = "INPUT";
JOYSTICK.associatedPins[0].internalResistor = "PULL_UP";
JOYSTICK.associatedPins[0].pin.$assign  = "PA9";

// HC05 蓝牙（hc05 模块：STATE 输入 = 连接状态指示（模块 STATE 脚高 = 手机
// 已连接；默认 PA8——与 DIGIT_UART TX / IR_BEAM OUT 默认重叠：K230 视觉/
// 红外对射与蓝牙链路互替，同选时经引脚绑定消解）；KEY 输出 = AT 模式切换
// 按键（KEY 高 + 重上电 = AT 命令模式；默认 PB24——与 STEP_MOTOR RST2 /
// SR04 TRIG 重叠，AT 切换不常用，同选时经引脚绑定消解））
HC05.$name = "HC05";
HC05.associatedPins.create(2);
HC05.associatedPins[0].$name            = "STATE";
HC05.associatedPins[0].direction        = "INPUT";
HC05.associatedPins[0].pin.$assign      = "PA8";
HC05.associatedPins[1].$name            = "KEY";
HC05.associatedPins[1].direction        = "OUTPUT";
HC05.associatedPins[1].initialValue     = "CLEARED";
HC05.associatedPins[1].pin.$assign      = "PB24";

// NRF24L01 2.4G 无线（nrf24l01 模块：软 SPI 位操作 6 脚——CLK/MOSI/CSN/CE
// 输出 + MISO/IRQ 输入；IRQ 输入不配中断（GPIO 中断只有 GROUP1 一路且被
// motor 编码器独占——NRF+电机是双车标配组合，定义第二个 GROUP1_IRQHandler
// 会链接期冲突，按手册轮询方式接收）。默认全 GPIOA 单口：CLK=PA26/MOSI=PA25/
// MISO=PA9/CSN=PA24/CE=PA23/IRQ=PA22——与 ZIGBEE_UART（PA26/PA25）、
// UWB/DEBUG_UART（PA23/PA24/PA22）、HUIDU 巡线（PA22-26）、joystick X/Y、
// adc、DIGIT_UART（PA9）默认重叠：NRF 与其它无线/巡线/手动输入互替、同选
// 概率最低，同选时经引脚绑定消解）
NRF24L01.$name = "NRF24L01";
NRF24L01.associatedPins.create(6);
NRF24L01.associatedPins[0].$name        = "CLK";
NRF24L01.associatedPins[0].direction    = "OUTPUT";
NRF24L01.associatedPins[0].initialValue = "CLEARED";
NRF24L01.associatedPins[0].pin.$assign  = "PA26";
NRF24L01.associatedPins[1].$name        = "MOSI";
NRF24L01.associatedPins[1].direction    = "OUTPUT";
NRF24L01.associatedPins[1].initialValue = "CLEARED";
NRF24L01.associatedPins[1].pin.$assign  = "PA25";
NRF24L01.associatedPins[2].$name        = "MISO";
NRF24L01.associatedPins[2].direction    = "INPUT";
NRF24L01.associatedPins[2].pin.$assign  = "PA9";
NRF24L01.associatedPins[3].$name        = "CSN";
NRF24L01.associatedPins[3].direction    = "OUTPUT";
NRF24L01.associatedPins[3].initialValue = "SET";
NRF24L01.associatedPins[3].pin.$assign  = "PA24";
NRF24L01.associatedPins[4].$name        = "CE";
NRF24L01.associatedPins[4].direction    = "OUTPUT";
NRF24L01.associatedPins[4].initialValue = "CLEARED";
NRF24L01.associatedPins[4].pin.$assign  = "PA23";
NRF24L01.associatedPins[5].$name        = "IRQ";
NRF24L01.associatedPins[5].direction    = "INPUT";
NRF24L01.associatedPins[5].pin.$assign  = "PA22";

// 红外遥控接收（ir_remote 模块：OUT 输入（接收头输出直接接 GPIO，上拉 = 无
// 信号高电平、有信号拉低）；NEC 解码用 CPU 忙等采样（delay 模块 20us 步进），
// 不占 TIMER（TIMG 全占，sr04 先例）；主循环轮询解码、不注册 GPIO 中断
// （GROUP1 只有一路且被 motor 编码器独占——红外+电机是经典组合）。默认
// PA26——与 ZIGBEE_TX/joystick X/NRF24L01 CLK 默认重叠（红外与其它无线/
// 手动输入互替、同选概率最低），同选时经引脚绑定消解）
IR_REMOTE.$name = "IR_REMOTE";
IR_REMOTE.associatedPins.create(1);
IR_REMOTE.associatedPins[0].$name            = "OUT";
IR_REMOTE.associatedPins[0].direction        = "INPUT";
IR_REMOTE.associatedPins[0].internalResistor = "PULL_UP";
IR_REMOTE.associatedPins[0].pin.$assign      = "PA26";

// MAX7219 数码管/点阵（max7219 模块：软 SPI 位操作 3 脚 DIN/CLK/CS，全强推挽
// 输出；位操作不占硬件 SPI 外设；CS 初始高 = 片选空闲。默认 DIN=PB9（与
// DC_MOTOR AIN1 重叠）/CLK=PA18（与 DC_MOTOR AIN2 重叠——PA18 兼 BSL 排针
// 脚，作输出无碍）/CS=PB18（与 DC_MOTOR BIN1 重叠）——大数字显示（计分/
// 计时/数据牌类固定装置）与双电机小车同选概率最低（小车状态显示惯走
// OLED），同选时经引脚绑定消解）
const MAX7219 = GPIO.addInstance();
MAX7219.$name = "MAX7219";
MAX7219.associatedPins.create(3);
MAX7219.associatedPins[0].$name        = "DIN";
MAX7219.associatedPins[0].direction    = "OUTPUT";
MAX7219.associatedPins[0].initialValue = "CLEARED";
MAX7219.associatedPins[0].pin.$assign  = "PB9";
MAX7219.associatedPins[1].$name        = "CLK";
MAX7219.associatedPins[1].direction    = "OUTPUT";
MAX7219.associatedPins[1].initialValue = "CLEARED";
MAX7219.associatedPins[1].pin.$assign  = "PA18";
MAX7219.associatedPins[2].$name        = "CS";
MAX7219.associatedPins[2].direction    = "OUTPUT";
MAX7219.associatedPins[2].initialValue = "SET";
MAX7219.associatedPins[2].pin.$assign  = "PB18";

// PCA9685 16 路舵机驱动板（pca9685 模块：软 I2C 位操作 2 脚 SCL/SDA——照
// AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。
// 默认 SCL=PB6 / SDA=PB7——与 STEP_MOTOR SLP2/DIR2、HUIDU R3/R4、
// AHT10 SCL/SDA（软 I2C 同型）、DHT11 DATA 重叠：16 路舵机多自由度执行与
// 温湿度采集（环境站类）/步进电机（单轴执行，互替）/8 路灰度巡线（车类）
// 同选概率最低，同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）
const PCA9685 = GPIO.addInstance();
PCA9685.$name = "PCA9685";
PCA9685.associatedPins.create(2);
PCA9685.associatedPins[0].$name        = "SCL";
PCA9685.associatedPins[0].direction    = "OUTPUT";
PCA9685.associatedPins[0].initialValue = "CLEARED";
PCA9685.associatedPins[0].pin.$assign  = "PB6";
PCA9685.associatedPins[1].$name        = "SDA";
PCA9685.associatedPins[1].direction    = "OUTPUT";
PCA9685.associatedPins[1].initialValue = "CLEARED";
PCA9685.associatedPins[1].pin.$assign  = "PB7";

// 红外编码发射（ir_remote_tx 模块：OUT 输出强推挽，38kHz NEC 载波位时序
// CPU 忙等 + delay 模块换算，不占 TIMER（照 ir_remote/ws2812 先例）；初始
// 低 = 载波空闲。默认 PA0——与 I2C_0 SDA（ml_mpu6050 姿态）/板载 LED 重叠
// （红外发射链与姿态采集同选概率最低；板载 LED 随载波闪烁可作发射指示），
// 且与 IR_REMOTE 默认 PA26 刻意错开（发射/接收本就常配对——双选默认即不撞，
// 同选时经引脚绑定消解）
const IR_TX = GPIO.addInstance();
IR_TX.$name = "IR_TX";
IR_TX.associatedPins.create(1);
IR_TX.associatedPins[0].$name        = "OUT";
IR_TX.associatedPins[0].direction    = "OUTPUT";
IR_TX.associatedPins[0].initialValue = "CLEARED";
IR_TX.associatedPins[0].pin.$assign  = "PA0";

