AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// JQ8900 语音播报（jq8900 模块：软 UART 单发 TX——GPIO 位操作 9600 8N1，
// 不占 UART 外设/TIMER（批次 4 UART 可行性调研：SysConfig CLI 拒绝同一
// UART 外设多实例，语音单向发指令帧走软 UART）；TX 输出初始 SET = 空闲高。
// 默认 PB19——DC_MOTOR 编码器 BA 脚：语音播报与双电机小车同选概率最低，
// 同选时经引脚绑定消解；与同批 syn6288 默认 PB20 刻意错开（语音两件常同选））
const JQ8900 = GPIO.addInstance();
JQ8900.$name = "JQ8900";
JQ8900.associatedPins.create(1);
JQ8900.associatedPins[0].$name        = "TX";
JQ8900.associatedPins[0].direction    = "OUTPUT";
JQ8900.associatedPins[0].initialValue = "SET";
JQ8900.associatedPins[0].pin.$assign  = "PB19";

// SYN6288 语音合成（syn6288 模块：软 UART 单发 TX——同 jq8900 先例，不占
// UART 外设/TIMER；TX 输出初始 SET = 空闲高。默认 PB20——DC_MOTOR 编码器
// BB 脚：语音合成与双电机小车同选概率最低；与同批 jq8900 默认 PB19 刻意
// 错开（语音两件常同选，默认即不撞），同选时经引脚绑定消解）
const SYN6288 = GPIO.addInstance();
SYN6288.$name = "SYN6288";
SYN6288.associatedPins.create(1);
SYN6288.associatedPins[0].$name        = "TX";
SYN6288.associatedPins[0].direction    = "OUTPUT";
SYN6288.associatedPins[0].initialValue = "SET";
SYN6288.associatedPins[0].pin.$assign  = "PB20";

// RC522 射频 IC 卡识别（rc522 模块：软 SPI 位操作 5 脚——CS/RST/SCK/MOSI
// 输出 + MISO 输入，单 RC522_PORT 宏；不占硬件 SPI 外设（nrf24l01 先例）。
// 默认 CS=PA7（DC_MOTOR BIN2 + SERVO_PWM 重叠）/RST=PA18（DC_MOTOR AIN2 +
// MAX7219 CLK）/SCK=PA14（DCC_100_PWM2 + WS2812 IN）/MOSI=PA16（编码器
// AA）/MISO=PA17（编码器 AB）——读卡与车类（双电机/舵机/步进）同选概率
// 最低，同选时经引脚绑定消解；五脚全 GPIOA 单口，与同批语音/指纹默认不撞）
const RC522 = GPIO.addInstance();
RC522.$name = "RC522";
RC522.associatedPins.create(5);
RC522.associatedPins[0].$name        = "CS";
RC522.associatedPins[0].direction    = "OUTPUT";
RC522.associatedPins[0].initialValue = "SET";
RC522.associatedPins[0].pin.$assign  = "PA7";
RC522.associatedPins[1].$name        = "RST";
RC522.associatedPins[1].direction    = "OUTPUT";
RC522.associatedPins[1].initialValue = "SET";
RC522.associatedPins[1].pin.$assign  = "PA18";
RC522.associatedPins[2].$name        = "SCK";
RC522.associatedPins[2].direction    = "OUTPUT";
RC522.associatedPins[2].initialValue = "SET";
RC522.associatedPins[2].pin.$assign  = "PA14";
RC522.associatedPins[3].$name        = "MOSI";
RC522.associatedPins[3].direction    = "OUTPUT";
RC522.associatedPins[3].initialValue = "CLEARED";
RC522.associatedPins[3].pin.$assign  = "PA16";
RC522.associatedPins[4].$name        = "MISO";
RC522.associatedPins[4].direction    = "INPUT";
RC522.associatedPins[4].pin.$assign  = "PA17";

// 指纹模块触摸感应输入（fingerprint 模块：模块 5 脚触摸信号输出高 = 检测到
// 触摸，VTI 接 3.3V——直连 GPIO 输入即可。默认 PA12——PWMAB C0（motor 双路
// PWM）+ BH1750 SCL 重叠：指纹与双电机/光照同选概率最低，同选时经引脚绑定
// 消解；与同批 jq8900/syn6288/rc522 默认不撞）
const FINGERPRINT = GPIO.addInstance();
FINGERPRINT.$name = "FINGERPRINT";
FINGERPRINT.associatedPins.create(1);
FINGERPRINT.associatedPins[0].$name        = "TOUCH";
FINGERPRINT.associatedPins[0].direction    = "INPUT";
FINGERPRINT.associatedPins[0].pin.$assign  = "PA12";

// LED/蜂鸣器输出（PA15；原 LaunchPad 值 PA3 = 32.768k 晶振脚，地猛星排针未引出）
LED_BEEP.$name = "LED_BEEP";
LED_BEEP.associatedPins.create(1);
LED_BEEP.associatedPins[0].$name        = "LED";
LED_BEEP.associatedPins[0].direction    = "OUTPUT";
LED_BEEP.associatedPins[0].initialValue = "CLEARED";
LED_BEEP.associatedPins[0].pin.$assign  = "PA15";

// 步进电机方向/使能（step_motor 模块：宏 STEP_MOTOR_RST2/SLP2/DIR2/DCY2_PIN，
// 四脚同 GPIOB → STEP_MOTOR_PORT = GPIOB；RST2/SLP2 空闲高有效，init 置高）
STEP_MOTOR.$name = "STEP_MOTOR";
STEP_MOTOR.associatedPins.create(4);
STEP_MOTOR.associatedPins[0].$name        = "RST2";
STEP_MOTOR.associatedPins[0].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[0].initialValue = "SET";
STEP_MOTOR.associatedPins[0].pin.$assign  = "PB24";
STEP_MOTOR.associatedPins[1].$name        = "SLP2";
STEP_MOTOR.associatedPins[1].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[1].initialValue = "SET";
STEP_MOTOR.associatedPins[1].pin.$assign  = "PB6";
STEP_MOTOR.associatedPins[2].$name        = "DIR2";
STEP_MOTOR.associatedPins[2].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[2].initialValue = "CLEARED";
STEP_MOTOR.associatedPins[2].pin.$assign  = "PB7";
STEP_MOTOR.associatedPins[3].$name        = "DCY2";
STEP_MOTOR.associatedPins[3].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[3].initialValue = "CLEARED";
STEP_MOTOR.associatedPins[3].pin.$assign  = "PB8";

// IMU 串口（RX 中断；UART0 = PA28(TX)/PA31(RX)——板载 CH340E 占用 UART0 默认脚
// PA10/PA11，勿用；imu_uart 模块接线注释同步此值）
IMU601.$name             = "IMU601";
IMU601.profile           = "CONFIG_PROFILE_1";
IMU601.peripheral.$assign = "UART0";
IMU601.uartClkSrc        = "BUSCLK";
IMU601.ovsRate           = "16";
IMU601.targetBaudRate    = 115200;
IMU601.enableInternalLoopback = false;
IMU601.enabledInterrupts = ["RX"];
IMU601.enableFIFO        = false;
IMU601.peripheral.rxPin.$assign = "PA31";
IMU601.peripheral.txPin.$assign = "PA28";

// K230 视觉串口（digit_uart/coord_detect 模块用，RX 中断；PA8/PA9 = UART1）
const DIGIT_UART = UART.addInstance();
DIGIT_UART.$name             = "DIGIT_UART";
DIGIT_UART.profile           = "CONFIG_PROFILE_1";
DIGIT_UART.peripheral.$assign = "UART1";
DIGIT_UART.uartClkSrc        = "BUSCLK";
DIGIT_UART.ovsRate           = "16";
DIGIT_UART.targetBaudRate    = 115200;
DIGIT_UART.enableInternalLoopback = false;
DIGIT_UART.enabledInterrupts = ["RX"];
DIGIT_UART.enableFIFO        = false;
DIGIT_UART.peripheral.rxPin.$assign = "PA9";
DIGIT_UART.peripheral.txPin.$assign = "PA8";

// 调试串口（debug_uart 模块用，RX 中断；UART2 = PA23(TX)/PA22(RX)。
// 与 UWB_UART 默认同 UART2——两模块同选时经引脚绑定换实例消解；
// PA23/PA22 与 HUIDU L2/L1 默认重叠，同选时改绑消解）
const DEBUG_UART = UART.addInstance();
DEBUG_UART.$name             = "DEBUG_UART";
DEBUG_UART.profile           = "CONFIG_PROFILE_1";
DEBUG_UART.peripheral.$assign = "UART2";
DEBUG_UART.uartClkSrc        = "BUSCLK";
DEBUG_UART.ovsRate           = "16";
DEBUG_UART.targetBaudRate    = 115200;
DEBUG_UART.enableInternalLoopback = false;
DEBUG_UART.enabledInterrupts = ["RX"];
DEBUG_UART.enableFIFO        = false;
DEBUG_UART.peripheral.rxPin.$assign = "PA22";
DEBUG_UART.peripheral.txPin.$assign = "PA23";

// UWB 定位串口（uwb_uart 模块用，RX 中断；UART2 = PA23(TX)/PA24(RX)。
// PA23/PA24 与 HUIDU L2/L3 默认重叠——两模块同选时经引脚绑定消解）
const UWB_UART = UART.addInstance();
UWB_UART.$name             = "UWB_UART";
UWB_UART.profile           = "CONFIG_PROFILE_1";
UWB_UART.peripheral.$assign = "UART2";
UWB_UART.uartClkSrc        = "BUSCLK";
UWB_UART.ovsRate           = "16";
UWB_UART.targetBaudRate    = 115200;
UWB_UART.enableInternalLoopback = false;
UWB_UART.enabledInterrupts = ["RX"];
UWB_UART.enableFIFO        = false;
UWB_UART.peripheral.rxPin.$assign = "PA24";
UWB_UART.peripheral.txPin.$assign = "PA23";

// Zigbee DL-20 串口（zigbee_uart 接收 / zigbee_uart_key 发送共享，
// RX 中断；UART3 = PA26(TX)/PA25(RX)。PA26/PA25 与 HUIDU R2/R3 默认
// 重叠——同选时经引脚绑定消解）
const ZIGBEE_UART = UART.addInstance();
ZIGBEE_UART.$name             = "ZIGBEE_UART";
ZIGBEE_UART.profile           = "CONFIG_PROFILE_1";
ZIGBEE_UART.peripheral.$assign = "UART3";
ZIGBEE_UART.uartClkSrc        = "BUSCLK";
ZIGBEE_UART.ovsRate           = "16";
ZIGBEE_UART.targetBaudRate    = 115200;
ZIGBEE_UART.enableInternalLoopback = false;
ZIGBEE_UART.enabledInterrupts = ["RX"];
ZIGBEE_UART.enableFIFO        = false;
ZIGBEE_UART.peripheral.rxPin.$assign = "PA25";
ZIGBEE_UART.peripheral.txPin.$assign = "PA26";

// HC05 蓝牙串口（hc05 模块：9600 8N1 透传——HC05 模块出厂默认波特率，与
// 其余 UART 实例 115200 独立无冲突；RX 中断 + FIFO 关闭；与 DEBUG_UART/
// UWB_UART 默认同 UART2 外设——两模块同选时经引脚绑定换实例消解；默认
// TX=PA23/RX=PA24 与 UWB_UART 同脚：蓝牙手机遥控与 UWB 定位链路互替、
// 同选概率最低，同选时经引脚绑定消解）
const HC05_UART = UART.addInstance();
HC05_UART.$name             = "HC05_UART";
HC05_UART.profile           = "CONFIG_PROFILE_1";
HC05_UART.peripheral.$assign = "UART2";
HC05_UART.uartClkSrc        = "BUSCLK";
HC05_UART.ovsRate           = "16";
HC05_UART.targetBaudRate    = 9600;
HC05_UART.enableInternalLoopback = false;
HC05_UART.enabledInterrupts = ["RX"];
HC05_UART.enableFIFO        = false;
HC05_UART.peripheral.rxPin.$assign = "PA24";
HC05_UART.peripheral.txPin.$assign = "PA23";

// 指纹识别（fingerprint 模块：AS608 串口双向——独立 UART 实例，批次 4 UART
// 可行性调研实证 SysConfig CLI 拒绝同一 UART 外设多实例，故不共享；默认
// UART0（IMU601 原脚 PA28/PA31——身份与姿态同选概率最低，单选裁剪后独占
// UART0，同选时经引脚绑定换实例消解）；57600 = 页面注释 AS608 默认波特率
// （市售 9600 出厂版改 targetBaudRate 一行即可，协议与波特率无关）；
// enabledInterrupts 空 = **轮询接收**（不注册 UART 中断、无 ISR 强符号）
const FINGERPRINT_UART = UART.addInstance();
FINGERPRINT_UART.$name             = "FINGERPRINT_UART";
FINGERPRINT_UART.profile           = "CONFIG_PROFILE_1";
FINGERPRINT_UART.peripheral.$assign = "UART0";
FINGERPRINT_UART.uartClkSrc        = "BUSCLK";
FINGERPRINT_UART.ovsRate           = "16";
FINGERPRINT_UART.targetBaudRate    = 57600;
FINGERPRINT_UART.enableInternalLoopback = false;
FINGERPRINT_UART.enabledInterrupts = [];
FINGERPRINT_UART.enableFIFO        = false;
FINGERPRINT_UART.peripheral.rxPin.$assign = "PA31";
FINGERPRINT_UART.peripheral.txPin.$assign = "PA28";

// OpenMV4 视觉串口（open_mv4 模块：主控侧 UART 帧解析 `[cx,cy]`——真实 UART
// 独立实例照 fingerprint「裁剪后独占」先例（批次 4 UART 可行性调研：SysConfig
// CLI 拒绝同一 UART 外设多实例、UART 实例上限 4 = UART0-3 外设数——母版 7 个
// UART 实例定义每工程先裁剪、裁剪后至多 4 实例，open_mv4 与另 ≤3 件 UART
// 模块同选在限内、4 件以上同选 = CLI 拒绝（既有约束类，notes 写明）；
// 同外设多实例同选时经引脚绑定换实例/换脚消解）；默认挂 UART1（页面原接线
// 「PA8/PA9 附加串口 1」，与 DIGIT_UART（K230 视觉）同外设同脚——OpenMV4 与
// K230 视觉互替、同选概率最低，单选裁剪后独占 UART1）；9600 = 页面案例波特率
// （独立于其余 115200 实例）；enabledInterrupts 空 = **轮询接收**（无 ISR
// 强符号——照 fingerprint 先例）
const OPENMV4_UART = UART.addInstance();
OPENMV4_UART.$name             = "OPENMV4_UART";
OPENMV4_UART.profile           = "CONFIG_PROFILE_1";
OPENMV4_UART.peripheral.$assign = "UART1";
OPENMV4_UART.uartClkSrc        = "BUSCLK";
OPENMV4_UART.ovsRate           = "16";
OPENMV4_UART.targetBaudRate    = 9600;
OPENMV4_UART.enableInternalLoopback = false;
OPENMV4_UART.enabledInterrupts = [];
OPENMV4_UART.enableFIFO        = false;
OPENMV4_UART.peripheral.rxPin.$assign = "PA9";
OPENMV4_UART.peripheral.txPin.$assign = "PA8";

// OLED（I2C 控制器）
OLED.$name                         = "OLED";
OLED.basicEnableController         = true;
OLED.basicControllerBusSpeed       = 400000;
OLED.intController                 = ["NACK", "TX_DONE"];
OLED.advAnalogGlitchFilter         = "DISABLED";
OLED.peripheral.$assign            = "I2C1";
OLED.peripheral.sdaPin.$assign     = "PB3";
OLED.peripheral.sclPin.$assign     = "PB2";

// MPU6050 姿态传感器（ml_mpu6050 模块：I2C_0_INST，轮询控制器模式；
// I2C0 = PA0(SDA)/PA1(SCL) 复用板载 LED 脚，通信期间 LED 微闪——地猛星 I2C0 的
// 另一组 PA28/PA31 已给 IMU601 UART0；PA1 板载 4.7k 上拉，PA0 上拉未焊 R12、
// 依赖 MPU6050 模块板自带）
I2C_0.$name                     = "I2C_0";
I2C_0.basicEnableController     = true;
I2C_0.basicControllerBusSpeed   = 400000;
I2C_0.peripheral.$assign        = "I2C0";
I2C_0.peripheral.sdaPin.$assign = "PA0";
I2C_0.peripheral.sclPin.$assign = "PA1";

